<template>
    <q-page class="q-pb-none">
        <q-sections class="">
            <q-img class="relative" src="AboutPage/about_people.svg"/>
            <q-img class="logo_ovz" src="AboutPage/logo_ovz.svg" />          
        </q-sections>
        <q-card class="card_bg text-bold text-h6 q-pl-xl">
            <q-card-section>
                Сформированные социально-психологические карты помогут сотрудникам вуза лучше понять потребности студентов с инвалидностью, обеспечивая более эффективную поддержку, что позволит создать благоприятные условия для их адаптации и успешного обучения в вузе.
            </q-card-section>
            <q-card-section>
                Наша интеллектуальная система для автоматизации формирования социально-психологической карты студентов с инвалидностью не только облегчает процесс адаптации, но и подчеркивает их творческий потенциал. Мы верим, что каждый студент, независимо от физических ограничений, способен раскрыть свои таланты и внести значительный вклад в культурную жизнь общества.
            </q-card-section>
            <q-card-section>
                Интеграция этой системы в образовательный процесс способствует созданию инклюзивной среды, где каждый студент чувствует себя комфортно и уверенно. Понимание индивидуальных особенностей и потребностей позволяет преподавателям и сотрудникам вуза предоставлять целенаправленную помощь, способствующую академическим и личностным успехам студентов. 
            </q-card-section>
            <q-card-section>
                Кроме того, наша система помогает выявлять и развивать творческий потенциал студентов с инвалидностью, создавая возможности для их участия в различных культурных и творческих проектах. Это не только обогащает студенческую жизнь, но и способствует формированию позитивного общественного мнения о возможностях людей с инвалидностью.
            </q-card-section>
            <q-card-section>
                Использование нашей системы также позволяет выявлять потенциальные проблемы на ранней стадии и оперативно принимать меры по их устранению. Это может включать корректировку учебных планов, предоставление дополнительных ресурсов или организацию специализированных тренингов для преподавателей и студентов.
            </q-card-section>
            <q-card-section class="q-pb-xl">
                  Наша цель - создать условия, в которых каждый студент, независимо от его физических возможностей, сможет максимально реализовать свой потенциал и достичь успеха в учебе и личной жизни. Мы стремимся к тому, чтобы каждый студент чувствовал себя полноценным членом университетского сообщества и имел равные возможности для развития и самореализации.
            </q-card-section>
        </q-card>
    </q-page>
</template>

<style>
.logo_ovz{
    max-width: 240px;
    position: absolute;
    left: 42%;
    top: 10%;
}
.card_bg{
    background-color: #E1E8F4;
}
</style>