<template>
    <q-card-section class="text-white text-h3 text-center bg-primary full-width q-py-md">
        НОРМАТИВНО-ПРАВОВАЯ БАЗА
      </q-card-section>
    <q-card class="q-pt-md">
        <div>
        <q-card class="text_style text-h6 q-ma-xl text-bold">
        <q-card-section class="text-justify">
            Нормативно-правовая база образования детей с ограниченными возможностями здоровья Реализация права на образование лиц с ограниченными возможностями здоровья и инвалидов традиционно является одним из значимых аспектов государственной политики в сфере образования. Нормативно-правовую базу в области образования детей с ограниченными возможностями здоровья в Российской Федерации составляют документы нескольких уровней: 
            <q-list dense class="">
                <q-item>- международные (подписанные СССР или Российской Федерацией);</q-item>
                <q-item>- федеральные (Конституция, законы, кодексы – семейный, гражданский и др.);</q-item>
                <q-item>- правительственные (постановления, распоряжения);</q-item>
                <q-item>- ведомственные (Министерства образования СССР и Российской Федерации);</q-item>
                <q-item>- региональные (правительственные и ведомственные).</q-item>
            </q-list>
            <q-card-section>
                Международные документы
            </q-card-section>
                  Международное законодательство в области закрепления права детей с ограниченными возможностями здоровья на получение образования имеет более чем полувековую историю развития. Одним из первых специальных международных актов, обратившихся к вопросу соблюдения прав личности, к которым относится и право на образование, является Всеобщая декларация прав человека от 10 декабря 1948 года, ставшая основой для других международно-правовых документов в области защиты прав личности. Декларация провозгласила как социальные, экономические и культурные права, так и политические и гражданские права.
                  <q-expansion-item v-model="openFirstItem" header-class="text-blue" label="Читать далее..." v-if="openFirstItem==false"/>
        </q-card-section>
    </q-card>
    <q-card-section class="q-ml-xl">
        <q-card class="text_style q-ma-sm text-h6 text-bold">
            <q-card-section class="text-justify">
                При этом международное сообщество сравнительно недавно обратило внимание на вопросы защиты прав инвалидов. До конца 70-х годов доминировала концепция признания за инвалидами всех основных прав без специальных мер защиты. Считалось, что принципы не дискриминации и уважения человеческого достоинства, провозглашенные в Международном билле о правах человека, достаточны для инвалидов. Однако изучение проблем инвалидности и практическая деятельность по защите прав инвалидов выявили необходимость создания отдельной международной системы защиты их прав. История международных документов, посвященных правам инвалидов, начинается с 1971 года, когда Организацией Объединенных Наций (ООН) была принята Декларация о правах умственно отсталых лиц (утверждена Резолюцией 2856 (XXVI) Генеральной Ассамблеи ООН от 20 декабря 1971 года). Международно-правовым документом обобщенного характера, признавшим право инвалидов на удовлетворительную жизнь, а также все гражданские и политические права, стала Декларация о правах инвалидов, утвержденная Резолюцией 3447 (XXX) Генеральной Ассамблеи ООН 09.12.1975 года. 16 декабря 1976 года Генеральная Ассамблея ООН провозгласила 1981 год Международным годом инвалидов, а период с 1983 по 1992-й год – Десятилетием инвалидов ООН. Наиболее важным результатом проведения Международного года инвалидов стало принятие Генеральной Ассамблеей ООН 3 декабря 1982 года Всемирной программы действий в отношении инвалидов. Международно-правовые документы по правам инвалидов, принятые до 1993 года, разрешали отдельные проблемы инвалидов, но не защищали права инвалидов в целом. И только в 1993 году был принят основной всеобъемлющий документ, посвященный правам инвалидов, – Стандартные правила обеспечения равных возможностей для инвалидов. На Всемирной конференции по образованию для лиц с особыми потребностями: доступ к образованию и его качество (Саламанка, Испания, 7–10 июня 1994 года) были приняты «Саламанкская декларация» и «Рамки действий по образованию лиц с особыми потребностями», в которых правительства всех стран призывают:
                <q-expansion-item v-model="openSecondItem" header-class="text-blue" label="Читать далее..." v-if="openSecondItem==false"/>
            </q-card-section>
        </q-card>
    </q-card-section>
</div>
    </q-card>
</template>
<script setup>
import { ref} from 'vue';

const openFirstItem = ref(false)
const openSecondItem = ref(false)
</script>

<style scoped>
.text_style{
    border: 1px solid;
    border-color: #4E82C1;
    border-radius: 20px;
}
</style>