<template>
    <q-card class="q-pt-xl">
        <q-card class="text_style">
        <q-card-section>
            Нормативно-правовая база образования детей с ограниченными возможностями здоровья Реализация права на образование лиц с ограниченными возможностями здоровья и инвалидов традиционно является одним из значимых аспектов государственной политики в сфере образования. Нормативно-правовую базу в области образования детей с ограниченными возможностями здоровья в Российской Федерации составляют документы нескольких уровней: международные (подписанные СССР или Российской Федерацией); федеральные (Конституция, законы, кодексы – семейный, гражданский и др.); правительственные (постановления, распоряжения); ведомственные (Министерства образования СССР и Российской Федерации); региональные (правительственные и ведомственные). Международные документы Международное законодательство в области закрепления права детей с ограниченными возможностями здоровья на получение образования имеет более чем полувековую историю развития. Одним из первых специальных международных актов, обратившихся к вопросу соблюдения прав личности, к которым относится и право на образование, является Всеобщая декларация прав человека от 10 декабря 1948 года, ставшая основой для других международно-правовых документов в области защиты прав личности. Декларация провозгласила как социальные, экономические и культурные права, так и политические и гражданские права. Читать далее...
        </q-card-section>
    </q-card>
    <q-card class="text_style">
        <q-card-section>
            Нормативно-правовая база образования детей с ограниченными возможностями здоровья Реализация права на образование лиц с ограниченными возможностями здоровья и инвалидов традиционно является одним из значимых аспектов государственной политики в сфере образования. Нормативно-правовую базу в области образования детей с ограниченными возможностями здоровья в Российской Федерации составляют документы нескольких уровней: международные (подписанные СССР или Российской Федерацией); федеральные (Конституция, законы, кодексы – семейный, гражданский и др.); правительственные (постановления, распоряжения); ведомственные (Министерства образования СССР и Российской Федерации); региональные (правительственные и ведомственные). Международные документы Международное законодательство в области закрепления права детей с ограниченными возможностями здоровья на получение образования имеет более чем полувековую историю развития. Одним из первых специальных международных актов, обратившихся к вопросу соблюдения прав личности, к которым относится и право на образование, является Всеобщая декларация прав человека от 10 декабря 1948 года, ставшая основой для других международно-правовых документов в области защиты прав личности. Декларация провозгласила как социальные, экономические и культурные права, так и политические и гражданские права. Читать далее...
        </q-card-section>
    </q-card>
    </q-card>
</template>

<style scoped>
.text_style{
    border: 1px solid;
    border-color: blue;
    border-radius: 20px;
}
</style>